Revit 2017 API
DirectShapeType.IsValidShape Method
Overload List
Name | Description
IsValidShape(IList<GeometryObject>)
 Validates shape to be stored in a DirectShapeType.
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType)
 Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type. Shape of this object expressed as a collection of Geometry objects
See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace